In [55]:
import pandas as pd

In [56]:
df = pd.DataFrame(np.random.randint(0, 100, size=(3, 5)), columns=['Passenger ID', 'Age', 'Calgary', 'Montreal', 'Quebec'])
print(df)

   Passenger ID  Age  Calgary  Montreal  Quebec
0            33   65       99        57       9
1            89   90        3        97      91
2            77   16       31         1      10

In [ ]:
d = {'PClass': [1, 2, 1, 2, 3, 3], 
     'Sex': ['male', 'male', 'female', 'female', 'male', 'female'], 
     'Age': [np.nan, np.nan, np.nan, np.nan, np.nan, np.nan]}
df = pd.DataFrame(data=d)

In [124]:
d = {'PClass': [1, 2, 1, 2, 3, 3], 
     'Sex': ['male', 'male', 'female', 'female', 'male', 'female'], 
     'Age': [34,24,29,40,18,25]}
df = pd.DataFrame(data=d)

In [125]:
df

   PClass     Sex  Age
0       1    male   34
1       2    male   24
2       1  female   29
3       2  female   40
4       3    male   18
5       3  female   25

In [91]:
# importing pandas as pd
import pandas as pd
  
# Create the MultiIndex
midx = pd.MultiIndex.from_tuples([('Male', 1), 
                                  ('Male', 2), 
                                  ('Male', 3),
                                  (20, 'Ten'), 
                                  (20, 'Twenty')], 
                                        names =['Num', 'Char'])

midx.to_frame(index = True)

              Num    Char
Num  Char
Male 1       Male       1
     2       Male       2
     3       Male       3
20   Ten       20     Ten
     Twenty    20  Twenty

In [117]:
import numpy as np
import pandas as pd
  
mldx_arrays = [np.array([1, 1,
                         2, 2,
                         3, 3]),
                 
               np.array(['male', 'female', 
                         'male', 'female',
                         'male', 'female'])]
  
# creating a multi-index dataframe
# with random data
multiindex_df = pd.DataFrame(
  [34,29,24,40,18,25], index=mldx_arrays,
  columns=['Age'])
  
multiindex_df.index.names = ['PClass', 'Sex']
multiindex_df

               Age
PClass Sex
1      male     34
       female   29
2      male     24
       female   40
3      male     18
       female   25